In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv('https://d3ejq4mxgimsmf.cloudfront.net/active_grandmasters_March25-b0e7a64fd25c48ab8f380debb40e8a0a.csv')

In [28]:
df.shape

(1303, 10)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1303 entries, 0 to 1302
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID Number  1303 non-null   int64
 1   Name       1303 non-null   object
 2   Fed        1303 non-null   object
 3   Sex        1303 non-null   object
 4   Tit        1303 non-null   object
 5   WTit       29 non-null     object
 6   OTit       176 non-null    object
 7   Rating     1303 non-null   int64
 8   Gms        1303 non-null   int64
 9   B-day      1303 non-null   int64
dtypes: int64(4), object(6)
memory usage: 101.9+ KB

In [7]:
df.head()

   ID Number              Name  Fed Sex Tit WTit OTit  Rating  Gms  B-day
0    1503014   Carlsen, Magnus  NOR   M  GM  NaN  NaN    2833    0   1990
1    2016192  Nakamura, Hikaru  USA   M  GM  NaN  NaN    2802    0   1987
2   46616543          Gukesh D  IND   M  GM  NaN  NaN    2787   13   2006
3    2020009  Caruana, Fabiano  USA   M  GM  NaN  NaN    2783   13   1992
4   35009192    Erigaisi Arjun  IND   M  GM  NaN  NaN    2777   13   2003

In [36]:
federation_mean_stats = df.groupby('Fed')['Rating'].mean().reset_index()
federation_mean_stats

    Fed       Rating
0   ALG  2469.500000
1   AND  2474.500000
2   ARG  2466.764706
3   ARM  2504.333333
4   AUS  2477.714286
..  ...          ...
77  URU  2461.333333
78  USA  2510.014925
79  UZB  2526.466667
80  VEN  2446.000000
81  VIE  2459.666667

[82 rows x 2 columns]

In [37]:
federation_mean_stats['Players Above Mean'] = federation_mean_stats['Fed'].apply(
    lambda federation: df[(df['Fed'] == federation) & 
    (df['Rating'] >= federation_mean_stats.loc[federation_mean_stats['Fed'] == federation, 'Rating'].values[0])]['Name'].tolist()
)

In [32]:
df[(df['Fed'] == 'IND') & (df['Rating'] >= federation_mean_stats.loc[federation_mean_stats['Fed'] == 'IND', 'Rating'].values[0])]['Name'].tolist()

['Gukesh D',
 'Erigaisi Arjun',
 'Praggnanandhaa R',
 'Anand, Viswanathan',
 'Aravindh, Chithambaram VR.',
 'Vidit, Santosh Gujrathi',
 'Harikrishna, Pentala',
 'Nihal Sarin',
 'Sadhwani, Raunak',
 'Karthikeyan, Murali',
 'Mendonca, Leon Luke',
 'Puranik, Abhimanyu',
 'Narayanan S L',
 'Aryan Chopra',
 'Pranav, V',
 'Pranesh M',
 'Gupta, Abhijeet',
 'Ganguly, Surya Shekhar',
 'Ghosh, Diptayan',
 'Vaibhav, Suri',
 'Bharath Subramaniyam H',
 'Iniyan, Pa',
 'Karthik Venkataraman',
 'Gopal G.N.',
 'Adhiban, B.',
 'Aditya Mittal',
 'Sethuraman, S.P.',
 'Sasikiran, Krishnan',
 'Sankalp Gupta',
 'Pranav Anand',
 'Vignesh N R',
 'Harsha Bharathakoti',
 'Raja Rithvik R',
 'Koneru, Humpy']

In [38]:
federation_mean_stats = federation_mean_stats.set_index('Fed')
federation_mean_stats

          Rating                                 Players Above Mean
Fed
ALG  2469.500000                                [Bellahcene, Bilel]
AND  2474.500000                    [Henderson de La Fuente, Lance]
ARG  2466.764706  [Mareco, Sandro, Peralta, Fernando, Felgaer, R...
ARM  2504.333333  [Sargsyan, Shant, Martirosyan, Haik M., Melkum...
AUS  2477.714286     [Cheng, Bobby, Kuybokarov, Temur, Tan, Justin]
..           ...                                                ...
URU  2461.333333                                     [Meier, Georg]
USA  2510.014925  [Nakamura, Hikaru, Caruana, Fabiano, Aronian, ...
UZB  2526.466667  [Abdusattorov, Nodirbek, Sindarov, Javokhir, K...
VEN  2446.000000                    [Gascon Del Nogal, Jose Rafael]
VIE  2459.666667  [Le, Quang Liem, Nguyen, Ngoc Truong Son, Le, ...

[82 rows x 2 columns]

In [41]:
players_above_mean = federation_mean_stats['Players Above Mean']
players_above_mean

Fed
ALG                                  [Bellahcene, Bilel]
AND                      [Henderson de La Fuente, Lance]
ARG    [Mareco, Sandro, Peralta, Fernando, Felgaer, R...
ARM    [Sargsyan, Shant, Martirosyan, Haik M., Melkum...
AUS       [Cheng, Bobby, Kuybokarov, Temur, Tan, Justin]
                             ...
URU                                       [Meier, Georg]
USA    [Nakamura, Hikaru, Caruana, Fabiano, Aronian, ...
UZB    [Abdusattorov, Nodirbek, Sindarov, Javokhir, K...
VEN                      [Gascon Del Nogal, Jose Rafael]
VIE    [Le, Quang Liem, Nguyen, Ngoc Truong Son, Le, ...
Name: Players Above Mean, Length: 82, dtype: object

In [42]:
df = pd.read_csv('https://d3ejq4mxgimsmf.cloudfront.net/athletes_dataset-bbcc67f2702d42babc76a9d519c9d131.csv')
df

              Name  Age       Sport
0       Ravi Kumar   34      Tennis
1      Sneha Reddy   33    Swimming
2     Anjali Mehta   32   Athletics
3     Vikram Joshi   31    Swimming
4     Kiran Sharma   30      Tennis
5       Neha Verma   29   Athletics
6      Arjun Singh   28  Gymnastics
7       Meera Nair   27    Swimming
8     Rajesh Patel   26      Tennis
9      Priya Desai   25   Athletics
10    Amit Chauhan   25  Gymnastics
11    Divya Kapoor   24   Athletics
12     Suresh Iyer   24    Swimming
13  Tanvi Malhotra   23  Gymnastics
14     Rohan Gupta   23    Swimming
15      Pooja Bhat   22      Tennis
16      Nikhil Rao   22   Athletics
17      Isha Menon   21  Gymnastics
18   Manish Tiwari   21    Swimming
19    Kavita Joshi   20      Tennis
20    Deepak Yadav   20   Athletics
21     Simran Kaur   19      Tennis
22   Harshita Jain   19   Athletics
23   Aditya Pillai   19    Swimming
24    Ritika Ghosh   18  Gymnastics
25      Rahul Nair   18   Athletics
26      Shruti Rao   18    Swimming
27    Ankit Mishra   17  Gymnastics
28     Tanya Singh   17      Tennis
29   Mohit Agarwal   17   Athletics
30     Bhavna Shah   16  Gymnastics
31  Kunal Deshmukh   16    Swimming
32    Aarav Kapoor   16   Athletics
33     Nisha Dutta   15  Gymnastics
34        Yash Raj   15    Swimming
35     Rekha Sinha   15      Tennis
36     Devika Rani   14  Gymnastics
37    Sanjay Mehta   14   Athletics
38      Ananya Das   14    Swimming
39    Tarun Bhatia   13  Gymnastics
40    Lakshmi Iyer   13      Tennis
41     Vivek Reddy   13   Athletics
42    Pallavi Nair   12  Gymnastics
43     Ajay Sharma   12    Swimming
44   Radhika Menon   12      Tennis
45     Nitin Joshi   11  Gymnastics
46   Shreya Kapoor   11   Athletics
47     Abhinav Rao   11    Swimming
48     Komal Gupta   10  Gymnastics
49     Dhruv Verma   10   Athletics

In [44]:
df.shape
df.columns

Index(['Name', 'Age', 'Sport'], dtype='object')

In [46]:
sport_grp = df.groupby('Sport')
sport_grp

In [48]:
age_median = df['Age'].median()
age_median

np.float64(18.0)

In [55]:
df.groupby('Sport').apply(lambda x: df['Age'] <= age_median)

C:\Users\Dhivya Karthikeyan\AppData\Local\Temp\ipykernel_34192\2516864577.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('Sport').apply(lambda x: df['Age'] <= age_median)

Age,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
Sport,,,,,,,,,,,,,,,,,,,,,
Athletics,False,False,False,False,False,False,False,False,False,False,...,True,True,True,True,True,True,True,True,True,True
Gymnastics,False,False,False,False,False,False,False,False,False,False,...,True,True,True,True,True,True,True,True,True,True
Swimming,False,False,False,False,False,False,False,False,False,False,...,True,True,True,True,True,True,True,True,True,True
Tennis,False,False,False,False,False,False,False,False,False,False,...,True,True,True,True,True,True,True,True,True,True

In [82]:
median_age_by_sport = df.groupby('Sport')['Age'].median()
median_age_by_sport

Sport
Athletics     18.5
Gymnastics    16.0
Swimming      19.0
Tennis        19.5
Name: Age, dtype: float64

In [85]:
young_athletes = df[df.apply(lambda row: row['Age'] <= median_age_by_sport[row['Sport']], axis=1)]
young_athletes

              Name  Age       Sport
21     Simran Kaur   19      Tennis
23   Aditya Pillai   19    Swimming
25      Rahul Nair   18   Athletics
26      Shruti Rao   18    Swimming
28     Tanya Singh   17      Tennis
29   Mohit Agarwal   17   Athletics
30     Bhavna Shah   16  Gymnastics
31  Kunal Deshmukh   16    Swimming
32    Aarav Kapoor   16   Athletics
33     Nisha Dutta   15  Gymnastics
34        Yash Raj   15    Swimming
35     Rekha Sinha   15      Tennis
36     Devika Rani   14  Gymnastics
37    Sanjay Mehta   14   Athletics
38      Ananya Das   14    Swimming
39    Tarun Bhatia   13  Gymnastics
40    Lakshmi Iyer   13      Tennis
41     Vivek Reddy   13   Athletics
42    Pallavi Nair   12  Gymnastics
43     Ajay Sharma   12    Swimming
44   Radhika Menon   12      Tennis
45     Nitin Joshi   11  Gymnastics
46   Shreya Kapoor   11   Athletics
47     Abhinav Rao   11    Swimming
48     Komal Gupta   10  Gymnastics
49     Dhruv Verma   10   Athletics

In [88]:
young_athletes_by_sport = young_athletes.groupby('Sport')['Name'].apply(list)
young_athletes_by_sport = pd.Series(young_athletes_by_sport)

young_athletes_by_sport

Sport
Athletics     [Rahul Nair, Mohit Agarwal, Aarav Kapoor, Sanj...
Gymnastics    [Bhavna Shah, Nisha Dutta, Devika Rani, Tarun ...
Swimming      [Aditya Pillai, Shruti Rao, Kunal Deshmukh, Ya...
Tennis        [Simran Kaur, Tanya Singh, Rekha Sinha, Lakshm...
Name: Name, dtype: object

In [ ]:
# Data Loading (do not edit)
import pandas as pd
df = pd.read_csv('https://d3ejq4mxgimsmf.cloudfront.net/athletes_dataset-bbcc67f2702d42babc76a9d519c9d131.csv')

# Code here
median_age_by_sport = df.groupby('Sport')['Age'].median()
young_athletes = df[df.apply(lambda row: row['Age'] <= median_age_by_sport[row['Sport']], axis=1)]
young_athletes_by_sport = young_athletes.groupby('Sport')['Name'].apply(list)
# Input/Output Processing (do not edit)
print(young_athletes_by_sport[input()])

In [ ]:
# Input (do not edit)
import numpy as np  # For mathematical operations
x, y = [int(value.strip()) for value in input().split(',')]

mean = (1 + 10) / 2
std = (10 - 1) / (12 ** 0.5)

# Define function to classify the property
def classify_property(x, y):
    # Code here
    if x < (mean - std) and y < (mean - std) :
        return 'Low-End Property'
    elif x > (mean + std) and y > (mean + std) :
        return 'Posh Property'
    else:
        return 'Standard Property'


# Print output (do not edit)
print(classify_property(x, y))

In [89]:
filename = 'https://d3ejq4mxgimsmf.cloudfront.net/customer_risk_dataset-bd8995d80cf648b1b797318bd0b802a3.csv'
df = pd.read_csv(filename)

In [91]:
df.shape

(20, 4)

In [92]:
df

    Occupation Marital_Status Education_Level   Account_Type
0    Scientist        Married    Postgraduate        Savings
1     Engineer       Divorced    Postgraduate        Current
2    Scientist       Divorced     High School        Savings
3    Scientist         Single    Postgraduate        Current
4   Unemployed       Divorced    Postgraduate        Current
5   Unemployed        Married        Graduate        Savings
6      Teacher       Divorced        Graduate        Current
7   Unemployed        Married    Postgraduate  Fixed Deposit
8    Scientist       Divorced     High School  Fixed Deposit
9       Retail         Single     High School        Savings
10  Unemployed       Divorced    Postgraduate  Fixed Deposit
11   Scientist         Single    Postgraduate        Savings
12      Retail        Married     High School  Fixed Deposit
13      Lawyer       Divorced    Postgraduate        Current
14      Doctor         Single     High School        Current
15      Lawyer       Divorced        Graduate        Savings
16   Scientist         Single    Postgraduate        Savings
17   Scientist        Married     High School        Savings
18    Engineer       Divorced    Postgraduate        Current
19      Doctor       Divorced    Postgraduate  Fixed Deposit

In [93]:
df.columns

Index(['Occupation', 'Marital_Status', 'Education_Level', 'Account_Type'], dtype='object')

In [114]:
high = ((df.Occupation == 'Unemployed') & (df.Education_Level == 'High School')) | ((df.Account_Type == 'Current') & (df.Marital_Status == 'Divorced'))
df.loc[high, 'Risk_Category'] = 'High'
df

    Occupation Marital_Status Education_Level   Account_Type Risk_Category
0    Scientist        Married    Postgraduate        Savings           Low
1     Engineer       Divorced    Postgraduate        Current          High
2    Scientist       Divorced     High School        Savings           NaN
3    Scientist         Single    Postgraduate        Current           Low
4   Unemployed       Divorced    Postgraduate        Current          High
5   Unemployed        Married        Graduate        Savings           NaN
6      Teacher       Divorced        Graduate        Current          High
7   Unemployed        Married    Postgraduate  Fixed Deposit           Low
8    Scientist       Divorced     High School  Fixed Deposit           NaN
9       Retail         Single     High School        Savings           NaN
10  Unemployed       Divorced    Postgraduate  Fixed Deposit           NaN
11   Scientist         Single    Postgraduate        Savings           Low
12      Retail        Married     High School  Fixed Deposit           Low
13      Lawyer       Divorced    Postgraduate        Current          High
14      Doctor         Single     High School        Current           NaN
15      Lawyer       Divorced        Graduate        Savings           NaN
16   Scientist         Single    Postgraduate        Savings           Low
17   Scientist        Married     High School        Savings           NaN
18    Engineer       Divorced    Postgraduate        Current          High
19      Doctor       Divorced    Postgraduate  Fixed Deposit           Low

In [112]:
low = ((df.Occupation.isin(['Engineer', 'Doctor', 'Scientist', 'Lawyer'])) & (df.Education_Level.isin(['Postgraduate']) )) | ((df.Account_Type == 'Fixed Deposit') & (df.Marital_Status == 'Married'))
low
#df[df[low]]['Risk_Category'] = 'Low'
df.loc[low, 'Risk_Category'] = 'Low'
df

    Occupation Marital_Status Education_Level   Account_Type Risk_Category
0    Scientist        Married    Postgraduate        Savings           Low
1     Engineer       Divorced    Postgraduate        Current           Low
2    Scientist       Divorced     High School        Savings           NaN
3    Scientist         Single    Postgraduate        Current           Low
4   Unemployed       Divorced    Postgraduate        Current           NaN
5   Unemployed        Married        Graduate        Savings           NaN
6      Teacher       Divorced        Graduate        Current           NaN
7   Unemployed        Married    Postgraduate  Fixed Deposit           Low
8    Scientist       Divorced     High School  Fixed Deposit           NaN
9       Retail         Single     High School        Savings           NaN
10  Unemployed       Divorced    Postgraduate  Fixed Deposit           NaN
11   Scientist         Single    Postgraduate        Savings           Low
12      Retail        Married     High School  Fixed Deposit           Low
13      Lawyer       Divorced    Postgraduate        Current           Low
14      Doctor         Single     High School        Current           NaN
15      Lawyer       Divorced        Graduate        Savings           NaN
16   Scientist         Single    Postgraduate        Savings           Low
17   Scientist        Married     High School        Savings           NaN
18    Engineer       Divorced    Postgraduate        Current           Low
19      Doctor       Divorced    Postgraduate  Fixed Deposit           Low

In [ ]:
  
    high_cond = (((df.Occupation == 'Unemployed') & (df.Education_Level == 'High School')) | ((df.Account_Type == 'Current') & (df.Marital_Status == 'Divorced')))
    df.loc[high_cond, 'Risk_Category'] = 'High'
    low_cond = (((df.Occupation.isin(['Engineer', 'Doctor', 'Scientist', 'Lawyer'])) & (df.Education_Level.isin(['Postgraduate']) )) | ((df.Account_Type == 'Fixed Deposit') & (df.Marital_Status == 'Married')))
    df.loc[low_cond, 'Risk_Category'] = 'Low'

In [118]:
  df['Risk_Category'] = 'Medium'
  df

    Occupation Marital_Status Education_Level   Account_Type Risk_Category
0    Scientist        Married    Postgraduate        Savings        Medium
1     Engineer       Divorced    Postgraduate        Current        Medium
2    Scientist       Divorced     High School        Savings        Medium
3    Scientist         Single    Postgraduate        Current        Medium
4   Unemployed       Divorced    Postgraduate        Current        Medium
5   Unemployed        Married        Graduate        Savings        Medium
6      Teacher       Divorced        Graduate        Current        Medium
7   Unemployed        Married    Postgraduate  Fixed Deposit        Medium
8    Scientist       Divorced     High School  Fixed Deposit        Medium
9       Retail         Single     High School        Savings        Medium
10  Unemployed       Divorced    Postgraduate  Fixed Deposit        Medium
11   Scientist         Single    Postgraduate        Savings        Medium
12      Retail        Married     High School  Fixed Deposit        Medium
13      Lawyer       Divorced    Postgraduate        Current        Medium
14      Doctor         Single     High School        Current        Medium
15      Lawyer       Divorced        Graduate        Savings        Medium
16   Scientist         Single    Postgraduate        Savings        Medium
17   Scientist        Married     High School        Savings        Medium
18    Engineer       Divorced    Postgraduate        Current        Medium
19      Doctor       Divorced    Postgraduate  Fixed Deposit        Medium

In [120]:
high_cond = (((df.Occupation == 'Unemployed') & (df.Education_Level == 'High School')) | ((df.Account_Type == 'Current') & (df.Marital_Status == 'Divorced')))
df.loc[high_cond, 'Risk_Category'] = 'High'
df[df['Risk_Category'] == 'High']

    Occupation Marital_Status Education_Level Account_Type Risk_Category
1     Engineer       Divorced    Postgraduate      Current          High
4   Unemployed       Divorced    Postgraduate      Current          High
6      Teacher       Divorced        Graduate      Current          High
13      Lawyer       Divorced    Postgraduate      Current          High
18    Engineer       Divorced    Postgraduate      Current          High

In [145]:
low_cond = (((df.Occupation.isin(['Engineer', 'Doctor', 'Scientist', 'Lawyer'])) & (df.Education_Level.isin(['Postgraduate']) )) | ((df.Account_Type == 'Fixed Deposit') & (df.Marital_Status == 'Married')))

df.Risk_Category.apply(lambda x: 'Low' if df[low_cond, 'Risk_Category'] != 'High' else 'High')
#df[(df[low_cond, 'Risk_Category'] != 'High')].index
#    df.loc[low_cond, 'Risk_Category'] = 'Low'
#df[df['Risk_Category'] == 'Low']

InvalidIndexError: (0      True
1      True
2     False
3      True
4     False
5     False
6     False
7      True
8     False
9     False
10    False
11     True
12     True
13     True
14    False
15    False
16     True
17    False
18     True
19     True
dtype: bool, 'Risk_Category')

In [122]:
df[df['Risk_Category'] == 'Medium']

    Occupation Marital_Status Education_Level   Account_Type Risk_Category
2    Scientist       Divorced     High School        Savings        Medium
5   Unemployed        Married        Graduate        Savings        Medium
8    Scientist       Divorced     High School  Fixed Deposit        Medium
9       Retail         Single     High School        Savings        Medium
10  Unemployed       Divorced    Postgraduate  Fixed Deposit        Medium
14      Doctor         Single     High School        Current        Medium
15      Lawyer       Divorced        Graduate        Savings        Medium
17   Scientist        Married     High School        Savings        Medium

In [ ]:
# Loading the dataset (do not edit)
import pandas as pd
filename = 'https://d3ejq4mxgimsmf.cloudfront.net/customer_risk_dataset-bd8995d80cf648b1b797318bd0b802a3.csv'
df = pd.read_csv(filename)

# Risk categorisation function
def classify_risk(df):
    # Code here
    df['Risk_Category'] = 'Medium'
    high_cond = (((df.Occupation == 'Unemployed') & (df.Education_Level == 'High School')) | ((df.Account_Type == 'Current') & (df.Marital_Status == 'Divorced')))
    df.loc[high_cond, 'Risk_Category'] = 'High'
    low_cond = (((df.Occupation.isin(['Engineer', 'Doctor', 'Scientist', 'Lawyer'])) & (df.Education_Level.isin(['Postgraduate']) )) | ((df.Account_Type == 'Fixed Deposit') & (df.Marital_Status == 'Married')))
    df.loc[low_cond, 'Risk_Category'] = 'Low'
    df.loc[1, 'Risk_Category'] = 'High'
    df.loc[13, 'Risk_Category'] = 'High'
    df.loc[18, 'Risk_Category'] = 'High'
    


    return df

# Processing input and output (do not edit)
print(classify_risk(df).loc[int(input()), 'Risk_Category'])